mhightower83/Arduino-ESP8266-misc/2.4.2/boards.txt
# From Customized boards.txt.py
# Abbreviated boards.txt created by: ./tools/boards.txt.py --boardsgen --boardlist
# The following boards were included:  --board=generic --board=esp8285 --board=huzzah --board=sonoff --board=espurnakmc --board=espurna --board=espurna85

# These setup some defaults I like.
huzzah.menu.FlashSize.4M3M=4M (3M SPIFFS)
huzzah.menu.UploadSpeed.921600=921600
# Update with your USB Serial device. I had to add the .0 and 0x for this to work.
# These entries will group up with those in boards.txt
huzzah.vid.0=0x10C4
huzzah.pid.0=0xEA60

sonoff.menu.UploadSpeed.230400.linux=230400
sonoff.menu.UploadSpeed.256000.windows=256000
sonoff.vid.0=0x0403
sonoff.pid.0=0x6001

#
# Do not create pull-requests for this file only, CI will not accept them.
# You *must* edit/modify/run boards.txt.py to regenerate boards.txt.
# All modified files after running with option "--allgen" must be included in the pull-request.
#

menu.BoardModel=Model
menu.my_project_flags=Project Build Flags
menu.espurna_ha=HA Platform
menu.espurna_flags=ESPurna Build Flags
menu.UploadSpeed=Upload Speed
menu.CpuFrequency=CPU Frequency
menu.CrystalFreq=Crystal Frequency
menu.FlashSize=Flash Size
menu.FlashMode=Flash Mode
menu.FlashFreq=Flash Frequency
menu.ResetMethod=Reset Method
menu.ESPModule=Module
menu.Debug=Debug port
menu.DebugLevel=Debug Level
menu.LwIPVariant=lwIP Variant
menu.VTable=VTables
menu.led=Builtin Led
menu.FlashErase=Erase Flash

##############################################################
generic.name=Generic ESP8266 Module
generic.build.board=ESP8266_GENERIC
generic.upload.tool=esptool
generic.upload.maximum_data_size=81920
generic.upload.wait_for_upload_port=true
generic.upload.erase_cmd=
generic.serial.disableDTR=true
generic.serial.disableRTS=true
generic.build.mcu=esp8266
generic.build.core=esp8266
generic.build.variant=generic
generic.build.spiffs_pagesize=256
generic.build.debug_port=
generic.build.debug_level=
generic.menu.CpuFrequency.80=80 MHz
generic.menu.CpuFrequency.80.build.f_cpu=80000000L
generic.menu.CpuFrequency.160=160 MHz
generic.menu.CpuFrequency.160.build.f_cpu=160000000L
generic.menu.VTable.flash=Flash
generic.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
generic.menu.VTable.heap=Heap
generic.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
generic.menu.VTable.iram=IRAM
generic.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
generic.menu.ResetMethod.ck=ck
generic.menu.ResetMethod.ck.upload.resetmethod=ck
generic.menu.ResetMethod.nodemcu=nodemcu
generic.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
generic.menu.ResetMethod.none=none
generic.menu.ResetMethod.none.upload.resetmethod=none
generic.menu.ResetMethod.dtrset=dtrset
generic.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
generic.menu.CrystalFreq.26=26 MHz
generic.menu.CrystalFreq.40=40 MHz
generic.menu.CrystalFreq.40.build.extra_flags=-DF_CRYSTAL=40000000 -DESP8266
generic.menu.FlashFreq.40=40MHz
generic.menu.FlashFreq.40.build.flash_freq=40
generic.menu.FlashFreq.80=80MHz
generic.menu.FlashFreq.80.build.flash_freq=80
generic.menu.FlashMode.qio=QIO
generic.menu.FlashMode.qio.build.flash_mode=qio
generic.menu.FlashMode.qout=QOUT
generic.menu.FlashMode.qout.build.flash_mode=qout
generic.menu.FlashMode.dio=DIO
generic.menu.FlashMode.dio.build.flash_mode=dio
generic.menu.FlashMode.dout=DOUT
generic.menu.FlashMode.dout.build.flash_mode=dout
generic.menu.FlashSize.512K0=512K (no SPIFFS)
generic.menu.FlashSize.512K0.build.flash_size=512K
generic.menu.FlashSize.512K0.build.flash_size_bytes=0x80000
generic.menu.FlashSize.512K0.build.flash_ld=eagle.flash.512k0.ld
generic.menu.FlashSize.512K0.build.spiffs_pagesize=256
generic.menu.FlashSize.512K0.upload.maximum_size=499696
generic.menu.FlashSize.512K0.build.rfcal_addr=0x7C000
generic.menu.FlashSize.512K32=512K (32K SPIFFS)
generic.menu.FlashSize.512K32.build.flash_size=512K
generic.menu.FlashSize.512K32.build.flash_size_bytes=0x80000
generic.menu.FlashSize.512K32.build.flash_ld=eagle.flash.512k32.ld
generic.menu.FlashSize.512K32.build.spiffs_pagesize=256
generic.menu.FlashSize.512K32.upload.maximum_size=466928
generic.menu.FlashSize.512K32.build.rfcal_addr=0x7C000
generic.menu.FlashSize.512K32.build.spiffs_start=0x73000
generic.menu.FlashSize.512K32.build.spiffs_end=0x7B000
generic.menu.FlashSize.512K32.build.spiffs_blocksize=4096
generic.menu.FlashSize.512K64=512K (64K SPIFFS)
generic.menu.FlashSize.512K64.build.flash_size=512K
generic.menu.FlashSize.512K64.build.flash_size_bytes=0x80000
generic.menu.FlashSize.512K64.build.flash_ld=eagle.flash.512k64.ld
generic.menu.FlashSize.512K64.build.spiffs_pagesize=256
generic.menu.FlashSize.512K64.upload.maximum_size=434160
generic.menu.FlashSize.512K64.build.rfcal_addr=0x7C000
generic.menu.FlashSize.512K64.build.spiffs_start=0x6B000
generic.menu.FlashSize.512K64.build.spiffs_end=0x7B000
generic.menu.FlashSize.512K64.build.spiffs_blocksize=4096
generic.menu.FlashSize.512K128=512K (128K SPIFFS)
generic.menu.FlashSize.512K128.build.flash_size=512K
generic.menu.FlashSize.512K128.build.flash_size_bytes=0x80000
generic.menu.FlashSize.512K128.build.flash_ld=eagle.flash.512k128.ld
generic.menu.FlashSize.512K128.build.spiffs_pagesize=256
generic.menu.FlashSize.512K128.upload.maximum_size=368624
generic.menu.FlashSize.512K128.build.rfcal_addr=0x7C000
generic.menu.FlashSize.512K128.build.spiffs_start=0x5B000
generic.menu.FlashSize.512K128.build.spiffs_end=0x7B000
generic.menu.FlashSize.512K128.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M0=1M (no SPIFFS)
generic.menu.FlashSize.1M0.build.flash_size=1M
generic.menu.FlashSize.1M0.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M0.build.flash_ld=eagle.flash.1m0.ld
generic.menu.FlashSize.1M0.build.spiffs_pagesize=256
generic.menu.FlashSize.1M0.upload.maximum_size=1023984
generic.menu.FlashSize.1M0.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M64=1M (64K SPIFFS)
generic.menu.FlashSize.1M64.build.flash_size=1M
generic.menu.FlashSize.1M64.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
generic.menu.FlashSize.1M64.build.spiffs_pagesize=256
generic.menu.FlashSize.1M64.upload.maximum_size=958448
generic.menu.FlashSize.1M64.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M64.build.spiffs_start=0xEB000
generic.menu.FlashSize.1M64.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M64.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M128=1M (128K SPIFFS)
generic.menu.FlashSize.1M128.build.flash_size=1M
generic.menu.FlashSize.1M128.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
generic.menu.FlashSize.1M128.build.spiffs_pagesize=256
generic.menu.FlashSize.1M128.upload.maximum_size=892912
generic.menu.FlashSize.1M128.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M128.build.spiffs_start=0xDB000
generic.menu.FlashSize.1M128.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M128.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M144=1M (144K SPIFFS)
generic.menu.FlashSize.1M144.build.flash_size=1M
generic.menu.FlashSize.1M144.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
generic.menu.FlashSize.1M144.build.spiffs_pagesize=256
generic.menu.FlashSize.1M144.upload.maximum_size=876528
generic.menu.FlashSize.1M144.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M144.build.spiffs_start=0xD7000
generic.menu.FlashSize.1M144.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M144.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M160=1M (160K SPIFFS)
generic.menu.FlashSize.1M160.build.flash_size=1M
generic.menu.FlashSize.1M160.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
generic.menu.FlashSize.1M160.build.spiffs_pagesize=256
generic.menu.FlashSize.1M160.upload.maximum_size=860144
generic.menu.FlashSize.1M160.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M160.build.spiffs_start=0xD3000
generic.menu.FlashSize.1M160.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M160.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M192=1M (192K SPIFFS)
generic.menu.FlashSize.1M192.build.flash_size=1M
generic.menu.FlashSize.1M192.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
generic.menu.FlashSize.1M192.build.spiffs_pagesize=256
generic.menu.FlashSize.1M192.upload.maximum_size=827376
generic.menu.FlashSize.1M192.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M192.build.spiffs_start=0xCB000
generic.menu.FlashSize.1M192.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M192.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M256=1M (256K SPIFFS)
generic.menu.FlashSize.1M256.build.flash_size=1M
generic.menu.FlashSize.1M256.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
generic.menu.FlashSize.1M256.build.spiffs_pagesize=256
generic.menu.FlashSize.1M256.upload.maximum_size=761840
generic.menu.FlashSize.1M256.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M256.build.spiffs_start=0xBB000
generic.menu.FlashSize.1M256.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M256.build.spiffs_blocksize=4096
generic.menu.FlashSize.1M512=1M (512K SPIFFS)
generic.menu.FlashSize.1M512.build.flash_size=1M
generic.menu.FlashSize.1M512.build.flash_size_bytes=0x100000
generic.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
generic.menu.FlashSize.1M512.build.spiffs_pagesize=256
generic.menu.FlashSize.1M512.upload.maximum_size=499696
generic.menu.FlashSize.1M512.build.rfcal_addr=0xFC000
generic.menu.FlashSize.1M512.build.spiffs_start=0x7B000
generic.menu.FlashSize.1M512.build.spiffs_end=0xFB000
generic.menu.FlashSize.1M512.build.spiffs_blocksize=8192
generic.menu.FlashSize.2M=2M (1M SPIFFS)
generic.menu.FlashSize.2M.build.flash_size=2M
generic.menu.FlashSize.2M.build.flash_size_bytes=0x200000
generic.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
generic.menu.FlashSize.2M.build.spiffs_pagesize=256
generic.menu.FlashSize.2M.upload.maximum_size=1044464
generic.menu.FlashSize.2M.build.rfcal_addr=0x1FC000
generic.menu.FlashSize.2M.build.spiffs_start=0x100000
generic.menu.FlashSize.2M.build.spiffs_end=0x1FB000
generic.menu.FlashSize.2M.build.spiffs_blocksize=8192
generic.menu.FlashSize.4M1M=4M (1M SPIFFS)
generic.menu.FlashSize.4M1M.build.flash_size=4M
generic.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
generic.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
generic.menu.FlashSize.4M1M.build.spiffs_pagesize=256
generic.menu.FlashSize.4M1M.upload.maximum_size=1044464
generic.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
generic.menu.FlashSize.4M1M.build.spiffs_start=0x300000
generic.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
generic.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
generic.menu.FlashSize.4M2M=4M (2M SPIFFS)
generic.menu.FlashSize.4M2M.build.flash_size=4M
generic.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
generic.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
generic.menu.FlashSize.4M2M.build.spiffs_pagesize=256
generic.menu.FlashSize.4M2M.upload.maximum_size=1044464
generic.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
generic.menu.FlashSize.4M2M.build.spiffs_start=0x200000
generic.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
generic.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
generic.menu.FlashSize.4M3M=4M (3M SPIFFS)
generic.menu.FlashSize.4M3M.build.flash_size=4M
generic.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
generic.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
generic.menu.FlashSize.4M3M.build.spiffs_pagesize=256
generic.menu.FlashSize.4M3M.upload.maximum_size=1044464
generic.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
generic.menu.FlashSize.4M3M.build.spiffs_start=0x100000
generic.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
generic.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
generic.menu.FlashSize.8M7M=8M (7M SPIFFS)
generic.menu.FlashSize.8M7M.build.flash_size=8M
generic.menu.FlashSize.8M7M.build.flash_size_bytes=0x800000
generic.menu.FlashSize.8M7M.build.flash_ld=eagle.flash.8m.ld
generic.menu.FlashSize.8M7M.build.spiffs_pagesize=256
generic.menu.FlashSize.8M7M.upload.maximum_size=1044464
generic.menu.FlashSize.8M7M.build.rfcal_addr=0x7FC000
generic.menu.FlashSize.8M7M.build.spiffs_start=0x100000
generic.menu.FlashSize.8M7M.build.spiffs_end=0x7FB000
generic.menu.FlashSize.8M7M.build.spiffs_blocksize=8192
generic.menu.FlashSize.16M15M=16M (15M SPIFFS)
generic.menu.FlashSize.16M15M.build.flash_size=16M
generic.menu.FlashSize.16M15M.build.flash_size_bytes=0x1000000
generic.menu.FlashSize.16M15M.build.flash_ld=eagle.flash.16m.ld
generic.menu.FlashSize.16M15M.build.spiffs_pagesize=256
generic.menu.FlashSize.16M15M.upload.maximum_size=1044464
generic.menu.FlashSize.16M15M.build.rfcal_addr=0xFFC000
generic.menu.FlashSize.16M15M.build.spiffs_start=0x100000
generic.menu.FlashSize.16M15M.build.spiffs_end=0xFFB000
generic.menu.FlashSize.16M15M.build.spiffs_blocksize=8192
generic.menu.led.2=2
generic.menu.led.2.build.led=-DLED_BUILTIN=2
generic.menu.led.0=0
generic.menu.led.0.build.led=-DLED_BUILTIN=0
generic.menu.led.1=1
generic.menu.led.1.build.led=-DLED_BUILTIN=1
generic.menu.led.3=3
generic.menu.led.3.build.led=-DLED_BUILTIN=3
generic.menu.led.4=4
generic.menu.led.4.build.led=-DLED_BUILTIN=4
generic.menu.led.5=5
generic.menu.led.5.build.led=-DLED_BUILTIN=5
generic.menu.led.6=6
generic.menu.led.6.build.led=-DLED_BUILTIN=6
generic.menu.led.7=7
generic.menu.led.7.build.led=-DLED_BUILTIN=7
generic.menu.led.8=8
generic.menu.led.8.build.led=-DLED_BUILTIN=8
generic.menu.led.9=9
generic.menu.led.9.build.led=-DLED_BUILTIN=9
generic.menu.led.10=10
generic.menu.led.10.build.led=-DLED_BUILTIN=10
generic.menu.led.11=11
generic.menu.led.11.build.led=-DLED_BUILTIN=11
generic.menu.led.12=12
generic.menu.led.12.build.led=-DLED_BUILTIN=12
generic.menu.led.13=13
generic.menu.led.13.build.led=-DLED_BUILTIN=13
generic.menu.led.14=14
generic.menu.led.14.build.led=-DLED_BUILTIN=14
generic.menu.led.15=15
generic.menu.led.15.build.led=-DLED_BUILTIN=15
generic.menu.my_project_flags.none=none
generic.menu.my_project_flags.nameresolv1=LLMNR Support
generic.menu.my_project_flags.nameresolv1.build.my_project_flags=-DLLMNR_SUPPORT
generic.menu.my_project_flags.nameresolv2=NetBIOS Support
generic.menu.my_project_flags.nameresolv2.build.my_project_flags=-DNETBIOS_SUPPORT
generic.menu.my_project_flags.nameresolv3=LLMNR and NetBIOS Support
generic.menu.my_project_flags.nameresolv3.build.my_project_flags=-DLLMNR_SUPPORT -DNETBIOS_SUPPORT
generic.menu.LwIPVariant.v2mss536=v2 Lower Memory
generic.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
generic.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
generic.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
generic.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
generic.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
generic.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
generic.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
generic.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
generic.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
generic.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
generic.menu.LwIPVariant.OpenSource=v1.4 Compile from source
generic.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
generic.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
generic.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
generic.menu.Debug.Disabled=Disabled
generic.menu.Debug.Disabled.build.debug_port=
generic.menu.Debug.Serial=Serial
generic.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
generic.menu.Debug.Serial1=Serial1
generic.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
generic.menu.DebugLevel.None____=None
generic.menu.DebugLevel.None____.build.debug_level=
generic.menu.DebugLevel.SSL=SSL
generic.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
generic.menu.DebugLevel.TLS_MEM=TLS_MEM
generic.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
generic.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
generic.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
generic.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
generic.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
generic.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
generic.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
generic.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
generic.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
generic.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
generic.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
generic.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
generic.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
generic.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
generic.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
generic.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
generic.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
generic.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
generic.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
generic.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
generic.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
generic.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
