mhightower83/Arduino-ESP8266-misc/2.4.2/boards.txt
##############################################################
sonoff.name=ITEAD Sonoff
sonoff.menu.BoardModel.sonoffS20.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffS20.build.board=SONOFF_S20
sonoff.menu.BoardModel.sonoffBasicIR.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffBasicIR.build.variant=sonoff
sonoff.menu.BoardModel.sonoffSV.build.variant=sonoff
sonoff.menu.BoardModel.sonoffBasicIR=ITEAD Sonoff Basic - IRremote
sonoff.menu.BoardModel.sonoffBasic=ITEAD Sonoff Basic
sonoff.menu.BoardModel.sonoffS20=ITEAD Sonoff S20
sonoff.menu.BoardModel.sonoffBasic.build.board=SONOFF_BASIC
sonoff.menu.BoardModel.sonoffSV.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffSV=ITEAD Sonoff SV
sonoff.menu.BoardModel.sonoffBasic.build.variant=sonoff
sonoff.build.extra_flags=-DESP8266
sonoff.menu.BoardModel.sonoffSV.build.board=SONOFF_SV
sonoff.menu.BoardModel.sonoffS20.build.variant=sonoff
sonoff.menu.BoardModel.sonoffBasicIR.build.board=SONOFF_BASIC
sonoff.menu.BoardModel.sonoffBasic.build.extra_flags=-DESP8266
sonoff.build.board=SONOFF_BASIC
sonoff.build.variant=sonoff
sonoff.upload.tool=esptool
sonoff.upload.maximum_data_size=81920
sonoff.upload.wait_for_upload_port=true
sonoff.upload.erase_cmd=
sonoff.serial.disableDTR=true
sonoff.serial.disableRTS=true
sonoff.build.mcu=esp8266
sonoff.build.core=esp8266
sonoff.build.spiffs_pagesize=256
sonoff.build.debug_port=
sonoff.build.debug_level=
sonoff.menu.CpuFrequency.80=80 MHz
sonoff.menu.CpuFrequency.80.build.f_cpu=80000000L
sonoff.menu.CpuFrequency.160=160 MHz
sonoff.menu.CpuFrequency.160.build.f_cpu=160000000L
sonoff.menu.VTable.flash=Flash
sonoff.menu.VTable.flash.build.vtable_flags=-DVTABLES_IN_FLASH
sonoff.menu.VTable.heap=Heap
sonoff.menu.VTable.heap.build.vtable_flags=-DVTABLES_IN_DRAM
sonoff.menu.VTable.iram=IRAM
sonoff.menu.VTable.iram.build.vtable_flags=-DVTABLES_IN_IRAM
sonoff.menu.my_project_flags.none=none
sonoff.menu.my_project_flags.nameresolv1=LLMNR Support
sonoff.menu.my_project_flags.nameresolv1.build.my_project_flags=-DLLMNR_SUPPORT
sonoff.menu.my_project_flags.nameresolv2=NetBIOS Support
sonoff.menu.my_project_flags.nameresolv2.build.my_project_flags=-DNETBIOS_SUPPORT
sonoff.menu.my_project_flags.nameresolv3=LLMNR and NetBIOS Support
sonoff.menu.my_project_flags.nameresolv3.build.my_project_flags=-DLLMNR_SUPPORT -DNETBIOS_SUPPORT
sonoff.menu.ResetMethod.none=none
sonoff.menu.ResetMethod.none.upload.resetmethod=none
sonoff.menu.ResetMethod.dtrset=dtrset
sonoff.menu.ResetMethod.dtrset.upload.resetmethod=dtrset
sonoff.menu.ResetMethod.ck=ck
sonoff.menu.ResetMethod.ck.upload.resetmethod=ck
sonoff.menu.ResetMethod.nodemcu=nodemcu
sonoff.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu
sonoff.menu.FlashFreq.40=40MHz
sonoff.menu.FlashFreq.40.build.flash_freq=40
sonoff.menu.FlashFreq.80=80MHz
sonoff.menu.FlashFreq.80.build.flash_freq=80
sonoff.menu.FlashMode.qio=QIO
sonoff.menu.FlashMode.qio.build.flash_mode=qio
sonoff.menu.FlashMode.qout=QOUT
sonoff.menu.FlashMode.qout.build.flash_mode=qout
sonoff.menu.FlashMode.dio=DIO
sonoff.menu.FlashMode.dio.build.flash_mode=dio
sonoff.menu.FlashMode.dout=DOUT
sonoff.menu.FlashMode.dout.build.flash_mode=dout
sonoff.menu.FlashSize.1M0=1M (no SPIFFS)
sonoff.menu.FlashSize.1M0.build.flash_size=1M
sonoff.menu.FlashSize.1M0.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M0.build.flash_ld=eagle.flash.1m0.ld
sonoff.menu.FlashSize.1M0.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M0.upload.maximum_size=1023984
sonoff.menu.FlashSize.1M0.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M64=1M (64K SPIFFS)
sonoff.menu.FlashSize.1M64.build.flash_size=1M
sonoff.menu.FlashSize.1M64.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
sonoff.menu.FlashSize.1M64.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M64.upload.maximum_size=958448
sonoff.menu.FlashSize.1M64.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M64.build.spiffs_start=0xEB000
sonoff.menu.FlashSize.1M64.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M64.build.spiffs_blocksize=4096
sonoff.menu.FlashSize.1M128=1M (128K SPIFFS)
sonoff.menu.FlashSize.1M128.build.flash_size=1M
sonoff.menu.FlashSize.1M128.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
sonoff.menu.FlashSize.1M128.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M128.upload.maximum_size=892912
sonoff.menu.FlashSize.1M128.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M128.build.spiffs_start=0xDB000
sonoff.menu.FlashSize.1M128.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M128.build.spiffs_blocksize=4096
sonoff.menu.FlashSize.1M144=1M (144K SPIFFS)
sonoff.menu.FlashSize.1M144.build.flash_size=1M
sonoff.menu.FlashSize.1M144.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
sonoff.menu.FlashSize.1M144.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M144.upload.maximum_size=876528
sonoff.menu.FlashSize.1M144.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M144.build.spiffs_start=0xD7000
sonoff.menu.FlashSize.1M144.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M144.build.spiffs_blocksize=4096
sonoff.menu.FlashSize.1M160=1M (160K SPIFFS)
sonoff.menu.FlashSize.1M160.build.flash_size=1M
sonoff.menu.FlashSize.1M160.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
sonoff.menu.FlashSize.1M160.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M160.upload.maximum_size=860144
sonoff.menu.FlashSize.1M160.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M160.build.spiffs_start=0xD3000
sonoff.menu.FlashSize.1M160.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M160.build.spiffs_blocksize=4096
sonoff.menu.FlashSize.1M192=1M (192K SPIFFS)
sonoff.menu.FlashSize.1M192.build.flash_size=1M
sonoff.menu.FlashSize.1M192.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
sonoff.menu.FlashSize.1M192.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M192.upload.maximum_size=827376
sonoff.menu.FlashSize.1M192.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M192.build.spiffs_start=0xCB000
sonoff.menu.FlashSize.1M192.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M192.build.spiffs_blocksize=4096
sonoff.menu.FlashSize.1M256=1M (256K SPIFFS)
sonoff.menu.FlashSize.1M256.build.flash_size=1M
sonoff.menu.FlashSize.1M256.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
sonoff.menu.FlashSize.1M256.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M256.upload.maximum_size=761840
sonoff.menu.FlashSize.1M256.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M256.build.spiffs_start=0xBB000
sonoff.menu.FlashSize.1M256.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M256.build.spiffs_blocksize=4096
sonoff.menu.FlashSize.1M512=1M (512K SPIFFS)
sonoff.menu.FlashSize.1M512.build.flash_size=1M
sonoff.menu.FlashSize.1M512.build.flash_size_bytes=0x100000
sonoff.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
sonoff.menu.FlashSize.1M512.build.spiffs_pagesize=256
sonoff.menu.FlashSize.1M512.upload.maximum_size=499696
sonoff.menu.FlashSize.1M512.build.rfcal_addr=0xFC000
sonoff.menu.FlashSize.1M512.build.spiffs_start=0x7B000
sonoff.menu.FlashSize.1M512.build.spiffs_end=0xFB000
sonoff.menu.FlashSize.1M512.build.spiffs_blocksize=8192
sonoff.menu.FlashSize.2M=2M (1M SPIFFS)
sonoff.menu.FlashSize.2M.build.flash_size=2M
sonoff.menu.FlashSize.2M.build.flash_size_bytes=0x200000
sonoff.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
sonoff.menu.FlashSize.2M.build.spiffs_pagesize=256
sonoff.menu.FlashSize.2M.upload.maximum_size=1044464
sonoff.menu.FlashSize.2M.build.rfcal_addr=0x1FC000
sonoff.menu.FlashSize.2M.build.spiffs_start=0x100000
sonoff.menu.FlashSize.2M.build.spiffs_end=0x1FB000
sonoff.menu.FlashSize.2M.build.spiffs_blocksize=8192
sonoff.menu.FlashSize.4M1M=4M (1M SPIFFS)
sonoff.menu.FlashSize.4M1M.build.flash_size=4M
sonoff.menu.FlashSize.4M1M.build.flash_size_bytes=0x400000
sonoff.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
sonoff.menu.FlashSize.4M1M.build.spiffs_pagesize=256
sonoff.menu.FlashSize.4M1M.upload.maximum_size=1044464
sonoff.menu.FlashSize.4M1M.build.rfcal_addr=0x3FC000
sonoff.menu.FlashSize.4M1M.build.spiffs_start=0x300000
sonoff.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
sonoff.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
sonoff.menu.FlashSize.4M2M=4M (2M SPIFFS)
sonoff.menu.FlashSize.4M2M.build.flash_size=4M
sonoff.menu.FlashSize.4M2M.build.flash_size_bytes=0x400000
sonoff.menu.FlashSize.4M2M.build.flash_ld=eagle.flash.4m2m.ld
sonoff.menu.FlashSize.4M2M.build.spiffs_pagesize=256
sonoff.menu.FlashSize.4M2M.upload.maximum_size=1044464
sonoff.menu.FlashSize.4M2M.build.rfcal_addr=0x3FC000
sonoff.menu.FlashSize.4M2M.build.spiffs_start=0x200000
sonoff.menu.FlashSize.4M2M.build.spiffs_end=0x3FB000
sonoff.menu.FlashSize.4M2M.build.spiffs_blocksize=8192
sonoff.menu.FlashSize.4M3M=4M (3M SPIFFS)
sonoff.menu.FlashSize.4M3M.build.flash_size=4M
sonoff.menu.FlashSize.4M3M.build.flash_size_bytes=0x400000
sonoff.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
sonoff.menu.FlashSize.4M3M.build.spiffs_pagesize=256
sonoff.menu.FlashSize.4M3M.upload.maximum_size=1044464
sonoff.menu.FlashSize.4M3M.build.rfcal_addr=0x3FC000
sonoff.menu.FlashSize.4M3M.build.spiffs_start=0x100000
sonoff.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
sonoff.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
sonoff.menu.FlashSize.8M7M=8M (7M SPIFFS)
sonoff.menu.FlashSize.8M7M.build.flash_size=8M
sonoff.menu.FlashSize.8M7M.build.flash_size_bytes=0x800000
sonoff.menu.FlashSize.8M7M.build.flash_ld=eagle.flash.8m.ld
sonoff.menu.FlashSize.8M7M.build.spiffs_pagesize=256
sonoff.menu.FlashSize.8M7M.upload.maximum_size=1044464
sonoff.menu.FlashSize.8M7M.build.rfcal_addr=0x7FC000
sonoff.menu.FlashSize.8M7M.build.spiffs_start=0x100000
sonoff.menu.FlashSize.8M7M.build.spiffs_end=0x7FB000
sonoff.menu.FlashSize.8M7M.build.spiffs_blocksize=8192
sonoff.menu.FlashSize.16M15M=16M (15M SPIFFS)
sonoff.menu.FlashSize.16M15M.build.flash_size=16M
sonoff.menu.FlashSize.16M15M.build.flash_size_bytes=0x1000000
sonoff.menu.FlashSize.16M15M.build.flash_ld=eagle.flash.16m.ld
sonoff.menu.FlashSize.16M15M.build.spiffs_pagesize=256
sonoff.menu.FlashSize.16M15M.upload.maximum_size=1044464
sonoff.menu.FlashSize.16M15M.build.rfcal_addr=0xFFC000
sonoff.menu.FlashSize.16M15M.build.spiffs_start=0x100000
sonoff.menu.FlashSize.16M15M.build.spiffs_end=0xFFB000
sonoff.menu.FlashSize.16M15M.build.spiffs_blocksize=8192
sonoff.menu.LwIPVariant.v2mss536=v2 Lower Memory
sonoff.menu.LwIPVariant.v2mss536.build.lwip_include=lwip2/include
sonoff.menu.LwIPVariant.v2mss536.build.lwip_lib=-llwip2
sonoff.menu.LwIPVariant.v2mss536.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=536
sonoff.menu.LwIPVariant.v2mss1460=v2 Higher Bandwidth
sonoff.menu.LwIPVariant.v2mss1460.build.lwip_include=lwip2/include
sonoff.menu.LwIPVariant.v2mss1460.build.lwip_lib=-llwip2_1460
sonoff.menu.LwIPVariant.v2mss1460.build.lwip_flags=-DLWIP_OPEN_SRC -DTCP_MSS=1460
sonoff.menu.LwIPVariant.Prebuilt=v1.4 Higher Bandwidth
sonoff.menu.LwIPVariant.Prebuilt.build.lwip_lib=-llwip_gcc
sonoff.menu.LwIPVariant.Prebuilt.build.lwip_flags=-DLWIP_OPEN_SRC
sonoff.menu.LwIPVariant.OpenSource=v1.4 Compile from source
sonoff.menu.LwIPVariant.OpenSource.build.lwip_lib=-llwip_src
sonoff.menu.LwIPVariant.OpenSource.build.lwip_flags=-DLWIP_OPEN_SRC
sonoff.menu.LwIPVariant.OpenSource.recipe.hooks.sketch.prebuild.1.pattern=make -C "{runtime.platform.path}/tools/sdk/lwip/src" install TOOLS_PATH="{runtime.tools.xtensa-lx106-elf-gcc.path}/bin/xtensa-lx106-elf-"
sonoff.menu.Debug.Disabled=Disabled
sonoff.menu.Debug.Disabled.build.debug_port=
sonoff.menu.Debug.Serial=Serial
sonoff.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
sonoff.menu.Debug.Serial1=Serial1
sonoff.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1
sonoff.menu.DebugLevel.None____=None
sonoff.menu.DebugLevel.None____.build.debug_level=
sonoff.menu.DebugLevel.SSL=SSL
sonoff.menu.DebugLevel.SSL.build.debug_level= -DDEBUG_ESP_SSL
sonoff.menu.DebugLevel.TLS_MEM=TLS_MEM
sonoff.menu.DebugLevel.TLS_MEM.build.debug_level= -DDEBUG_ESP_TLS_MEM
sonoff.menu.DebugLevel.HTTP_CLIENT=HTTP_CLIENT
sonoff.menu.DebugLevel.HTTP_CLIENT.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.DebugLevel.HTTP_SERVER=HTTP_SERVER
sonoff.menu.DebugLevel.HTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.SSLTLS_MEM=SSL+TLS_MEM
sonoff.menu.DebugLevel.SSLTLS_MEM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM
sonoff.menu.DebugLevel.SSLHTTP_CLIENT=SSL+HTTP_CLIENT
sonoff.menu.DebugLevel.SSLHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.DebugLevel.SSLHTTP_SERVER=SSL+HTTP_SERVER
sonoff.menu.DebugLevel.SSLHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.TLS_MEMHTTP_CLIENT=TLS_MEM+HTTP_CLIENT
sonoff.menu.DebugLevel.TLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.DebugLevel.TLS_MEMHTTP_SERVER=TLS_MEM+HTTP_SERVER
sonoff.menu.DebugLevel.TLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER=HTTP_CLIENT+HTTP_SERVER
sonoff.menu.DebugLevel.HTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT=SSL+TLS_MEM+HTTP_CLIENT
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENT.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER=SSL+TLS_MEM+HTTP_SERVER
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER=SSL+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.DebugLevel.SSLHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER=TLS_MEM+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.DebugLevel.TLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVER.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER
sonoff.menu.DebugLevel.CORE=CORE
sonoff.menu.DebugLevel.CORE.build.debug_level= -DDEBUG_ESP_CORE
sonoff.menu.DebugLevel.WIFI=WIFI
sonoff.menu.DebugLevel.WIFI.build.debug_level= -DDEBUG_ESP_WIFI
sonoff.menu.DebugLevel.HTTP_UPDATE=HTTP_UPDATE
sonoff.menu.DebugLevel.HTTP_UPDATE.build.debug_level= -DDEBUG_ESP_HTTP_UPDATE
sonoff.menu.DebugLevel.UPDATER=UPDATER
sonoff.menu.DebugLevel.UPDATER.build.debug_level= -DDEBUG_ESP_UPDATER
sonoff.menu.DebugLevel.OTA=OTA
sonoff.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
sonoff.menu.DebugLevel.OOM=OOM
sonoff.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
sonoff.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
sonoff.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
sonoff.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
sonoff.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
sonoff.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
sonoff.menu.FlashErase.none=Only Sketch
sonoff.menu.FlashErase.none.upload.erase_cmd=
sonoff.menu.FlashErase.sdk=Sketch + WiFi Settings
sonoff.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
sonoff.menu.FlashErase.all=All Flash Contents
sonoff.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
sonoff.menu.UploadSpeed.115200=115200
sonoff.menu.UploadSpeed.115200.upload.speed=115200
sonoff.menu.UploadSpeed.9600=9600
sonoff.menu.UploadSpeed.9600.upload.speed=9600
sonoff.menu.UploadSpeed.57600=57600
sonoff.menu.UploadSpeed.57600.upload.speed=57600
sonoff.menu.UploadSpeed.230400.linux=230400
sonoff.menu.UploadSpeed.230400.macosx=230400
sonoff.menu.UploadSpeed.230400.upload.speed=230400
sonoff.menu.UploadSpeed.256000.windows=256000
sonoff.menu.UploadSpeed.256000.upload.speed=256000
sonoff.menu.UploadSpeed.460800.linux=460800
sonoff.menu.UploadSpeed.460800.macosx=460800
sonoff.menu.UploadSpeed.460800.upload.speed=460800
sonoff.menu.UploadSpeed.512000.windows=512000
sonoff.menu.UploadSpeed.512000.upload.speed=512000
sonoff.menu.UploadSpeed.921600=921600
sonoff.menu.UploadSpeed.921600.upload.speed=921600

