mhightower83/Arduino-ESP8266-misc/2.4.2/boards.txt
espurna85.menu.DebugLevel.OTA=OTA
espurna85.menu.DebugLevel.OTA.build.debug_level= -DDEBUG_ESP_OTA
espurna85.menu.DebugLevel.OOM=OOM
espurna85.menu.DebugLevel.OOM.build.debug_level= -DDEBUG_ESP_OOM
espurna85.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM=CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurna85.menu.DebugLevel.COREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurna85.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM=SSL+TLS_MEM+HTTP_CLIENT+HTTP_SERVER+CORE+WIFI+HTTP_UPDATE+UPDATER+OTA+OOM
espurna85.menu.DebugLevel.SSLTLS_MEMHTTP_CLIENTHTTP_SERVERCOREWIFIHTTP_UPDATEUPDATEROTAOOM.build.debug_level= -DDEBUG_ESP_SSL -DDEBUG_ESP_TLS_MEM -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_ESP_OOM
espurna85.menu.DebugLevel.NoAssert-NDEBUG=NoAssert-NDEBUG
espurna85.menu.DebugLevel.NoAssert-NDEBUG.build.debug_level= -DNDEBUG
espurna85.menu.FlashErase.none=Only Sketch
espurna85.menu.FlashErase.none.upload.erase_cmd=
espurna85.menu.FlashErase.sdk=Sketch + WiFi Settings
espurna85.menu.FlashErase.sdk.upload.erase_cmd=-ca "{build.rfcal_addr}" -cz 0x4000
espurna85.menu.FlashErase.all=All Flash Contents
espurna85.menu.FlashErase.all.upload.erase_cmd=-ca 0x0 -cz "{build.flash_size_bytes}"
espurna85.menu.UploadSpeed.115200=115200
espurna85.menu.UploadSpeed.115200.upload.speed=115200
espurna85.menu.UploadSpeed.9600=9600
espurna85.menu.UploadSpeed.9600.upload.speed=9600
espurna85.menu.UploadSpeed.57600=57600
espurna85.menu.UploadSpeed.57600.upload.speed=57600
espurna85.menu.UploadSpeed.230400.linux=230400
espurna85.menu.UploadSpeed.230400.macosx=230400
espurna85.menu.UploadSpeed.230400.upload.speed=230400
espurna85.menu.UploadSpeed.256000.windows=256000
espurna85.menu.UploadSpeed.256000.upload.speed=256000
espurna85.menu.UploadSpeed.460800.linux=460800
espurna85.menu.UploadSpeed.460800.macosx=460800
espurna85.menu.UploadSpeed.460800.upload.speed=460800
espurna85.menu.UploadSpeed.512000.windows=512000
espurna85.menu.UploadSpeed.512000.upload.speed=512000
espurna85.menu.UploadSpeed.921600=921600
espurna85.menu.UploadSpeed.921600.upload.speed=921600

